[
  {
    "name": "Adaptability",
    "effect": "Adaptability increases the effectiveness of STAB moves from the usual 1.5× to 2×.",
    "desc": "Powers up moves of the same type as the Pokémon.",
    "id": "adaptability",
    "searchTerms": [
      "adaptability"
    ]
  },
  {
    "name": "Aftermath",
    "effect": "If an attacker faints a Pokémon with Aftermath using a contact move, the attacker will lose 1⁄4 of their maximum HP.",
    "desc": "Damages the attacker if it knocks out the Pokémon with a move that makes direct contact.",
    "id": "aftermath",
    "searchTerms": [
      "aftermath"
    ]
  },
  {
    "name": "Air Lock",
    "effect": "Air Lock suppresses all effects brought on by weather, including move power increases, end-of-turn damage, accuracy changes, relevant abilities and so on.",
    "desc": "Eliminates the effects of weather.",
    "id": "air-lock",
    "searchTerms": [
      "air",
      "lock"
    ]
  },
  {
    "name": "Analytic",
    "effect": "Boosts move power when the Pokémon moves last.\n",
    "desc": "Boosts the power of the Pokémon's move if it is the last to act that turn.",
    "id": "analytic",
    "searchTerms": [
      "analytic"
    ]
  },
  {
    "name": "Anger Point",
    "effect": "Anger Point raises the ability-bearer's Attack to its maximum level - +6 stages or 4× usual power - when a move targeting it receives a critical hit.",
    "desc": "The Pokémon is angered when it takes a critical hit, and that maxes its Attack stat.",
    "id": "anger-point",
    "searchTerms": [
      "anger",
      "point"
    ]
  },
  {
    "name": "Anger Shell",
    "effect": "When the Pokémon's HP drops below half, Anger Shell lowers its Defense and Special Defense but its Attack, Special Attack and Speed are raised.",
    "desc": "When an attack causes its HP to drop to half or less, the Pokémon gets angry. This lowers its Defense and Sp. Def stats but boosts its Attack, Sp. Atk, and Speed stats.",
    "id": "anger-shell",
    "searchTerms": [
      "anger",
      "shell"
    ]
  },
  {
    "name": "Anticipation",
    "effect": "A Pokémon with Anticipation will shudder upon entering battle, if an opponent has a move that is super-effective against it, or a One-Hit-KO move (Fissure, Horn Drill, Guillotine or Sheer Cold). It only activates when the ability-bearer switches in, not when an opponent switches in.",
    "desc": "The Pokémon can sense an opposing Pokémon's dangerous moves.",
    "id": "anticipation",
    "searchTerms": [
      "anticipation"
    ]
  },
  {
    "name": "Arena Trap",
    "effect": "Arena Trap prevents opponents from fleeing or switching out. Raised Pokémon are not affected. Raised Pokémon are any Flying types or those under the effects of Levitate, Magnet Rise or Telekinesis. Full details in glossary.",
    "desc": "Prevents opposing Pokémon from fleeing from battle.",
    "id": "arena-trap",
    "searchTerms": [
      "arena",
      "trap"
    ]
  },
  {
    "name": "Armor Tail",
    "effect": "Armor Tail prevents the opponent from using any moves that have priority, such as Quick Attack.",
    "desc": "The mysterious tail covering the Pokémon's head makes opponents unable to use priority moves against the Pokémon or its allies.",
    "id": "armor-tail",
    "searchTerms": [
      "armor",
      "tail"
    ]
  },
  {
    "name": "Aroma Veil",
    "effect": "Protects allies from attacks that limit their move choices.\n",
    "desc": "Protects the Pokémon and its allies from effects that prevent the use of moves.",
    "id": "aroma-veil",
    "searchTerms": [
      "aroma",
      "veil"
    ]
  },
  {
    "name": "As One",
    "effect": "Combines Unnerve and Chilling Neigh/Grim Neigh\n",
    "desc": "This Ability combines the effects of both Calyrex's Unnerve Ability and Glastrier's/Spectrier's Chilling Neigh/Grim Neigh Ability.",
    "id": "as-one",
    "searchTerms": [
      "as",
      "one"
    ]
  },
  {
    "name": "Bad Dreams",
    "effect": "Bad Dreams causes all sleeping opponents to lose 1⁄8 of their maximum HP at the end of each turn.",
    "desc": "Damages opposing Pokémon that are asleep.",
    "id": "bad-dreams",
    "searchTerms": [
      "bad",
      "dreams"
    ]
  },
  {
    "name": "Battery",
    "effect": "Battery allows the Pokémon to raise the power of teammates' special moves.",
    "desc": "Powers up ally Pokémon's special moves.",
    "id": "battery",
    "searchTerms": [
      "battery"
    ]
  },
  {
    "name": "Battle Armor",
    "effect": "Battle Armor prevents the Pokémon from receiving a critical hit.",
    "desc": "Hard armor protects the Pokémon from critical hits.",
    "id": "battle-armor",
    "searchTerms": [
      "battle",
      "armor"
    ]
  },
  {
    "name": "Beads of Ruin",
    "effect": "Lowers Special Defense of all Pokémon except itself.\n",
    "desc": "The power of the Pokémon's ruinous beads lowers the Sp. Def stats of all Pokémon except itself.",
    "id": "beads-of-ruin",
    "searchTerms": [
      "beads",
      "of",
      "ruin"
    ]
  },
  {
    "name": "Berserk",
    "effect": "Berserk raises the Pokémon's Special Attack by one stage when its HP falls below 50%.",
    "desc": "Boosts the Pokémon's Sp. Atk stat when it takes a hit that causes its HP to drop to half or less.",
    "id": "berserk",
    "searchTerms": [
      "berserk"
    ]
  },
  {
    "name": "Big Pecks",
    "effect": "Big Pecks prevents the ability-bearer's Defense stat from being lowered, for example via Tail Whip.",
    "desc": "Prevents the Pokémon from having its Defense stat lowered.",
    "id": "big-pecks",
    "searchTerms": [
      "big",
      "pecks"
    ]
  },
  {
    "name": "Blaze",
    "effect": "Blaze increases the power of Fire-type moves by 50% (1.5×) when the ability-bearer's HP falls below a third of its maximum (known in-game as in a pinch).",
    "desc": "Powers up Fire-type moves when the Pokémon's HP is low.",
    "id": "blaze",
    "searchTerms": [
      "blaze"
    ]
  },
  {
    "name": "Bulletproof",
    "effect": "Bulletproof makes the Pokémon immune to ball and bomb moves.",
    "desc": "Protects the Pokémon from ball and bomb moves.",
    "id": "bulletproof",
    "searchTerms": [
      "bulletproof"
    ]
  },
  {
    "name": "Cheek Pouch",
    "effect": "Cheek Pouch restores the bearer's HP when a Berry is consumed, on top of the berry's usual effects.",
    "desc": "The Pokémon's HP is restored when it eats any Berry, in addition to the Berry's usual effect.",
    "id": "cheek-pouch",
    "searchTerms": [
      "cheek",
      "pouch"
    ]
  },
  {
    "name": "Chilling Neigh",
    "effect": "Boosts Attack after knocking out a Pokémon.\n",
    "desc": "When the Pokémon knocks out a target, it utters a chilling neigh, which boosts its Attack stat.",
    "id": "chilling-neigh",
    "searchTerms": [
      "chilling",
      "neigh"
    ]
  },
  {
    "name": "Chlorophyll",
    "effect": "Chlorophyll doubles the ability-bearer's Speed during bright sunshine.",
    "desc": "Boosts the Pokémon's Speed stat in harsh sunlight.",
    "id": "chlorophyll",
    "searchTerms": [
      "chlorophyll"
    ]
  },
  {
    "name": "Clear Body",
    "effect": "Prevents other Pokémon from lowering its stats.\n",
    "desc": "Prevents other Pokémon's moves or Abilities from lowering the Pokémon's stats.",
    "id": "clear-body",
    "searchTerms": [
      "clear",
      "body"
    ]
  },
  {
    "name": "Cloud Nine",
    "effect": "Cloud Nine suppresses all effects brought on by weather, including move power increases, end-of-turn damage, accuracy changes, relevant abilities and so on.",
    "desc": "Eliminates the effects of weather.",
    "id": "cloud-nine",
    "searchTerms": [
      "cloud",
      "nine"
    ]
  },
  {
    "name": "Comatose",
    "effect": "Comatose causes the Pokémon to behave as if it were asleep, though it doesn't officially have the Sleep status condition. It can still use its regular moves, but cannot be inflicted with any major status condition (sleep, poison, paralysis, burn, or freeze).",
    "desc": "The Pokémon is always drowsing and will never wake up. It can attack while in its sleeping state.",
    "id": "comatose",
    "searchTerms": [
      "comatose"
    ]
  },
  {
    "name": "Commander",
    "effect": "Goes inside the mouth of an ally Dondozo if one is on the field.\n",
    "desc": "When the Pokémon enters a battle, it goes inside the mouth of an ally Dondozo if one is on the field. The Pokémon then issues commands from there.",
    "id": "commander",
    "searchTerms": [
      "commander"
    ]
  },
  {
    "name": "Competitive",
    "effect": "Competitive raises the ability-bearer's Special Attack by two stages when hit by a stat-lowering move.",
    "desc": "Boosts the Pokémon's Sp. Atk stat sharply when its stats are lowered by an opposing Pokémon.",
    "id": "competitive",
    "searchTerms": [
      "competitive"
    ]
  },
  {
    "name": "Compound Eyes",
    "effect": "Compound Eyes raises the ability-bearer's accuracy by 30%.",
    "desc": "The Pokémon's compound eyes boost its accuracy.",
    "id": "compound-eyes",
    "searchTerms": [
      "compound",
      "eyes"
    ]
  },
  {
    "name": "Contrary",
    "effect": "Makes stat changes have an opposite effect.\n",
    "desc": "Reverses any stat changes affecting the Pokémon so that attempts to boost its stats instead lower them— and attempts to lower its stats will boost them.",
    "id": "contrary",
    "searchTerms": [
      "contrary"
    ]
  },
  {
    "name": "Corrosion",
    "effect": "Corrosion allows the bearer to poison any Pokémon, including Steel and Poison types.",
    "desc": "The Pokémon can poison the target even if it's a Steel or Poison type.",
    "id": "corrosion",
    "searchTerms": [
      "corrosion"
    ]
  },
  {
    "name": "Costar",
    "effect": "Copies ally's stat changes on entering battle.\n",
    "desc": "When the Pokémon enters a battle, it copies an ally's stat changes.",
    "id": "costar",
    "searchTerms": [
      "costar"
    ]
  },
  {
    "name": "Cud Chew",
    "effect": "Cud Chew causes the Pokémon to reuse an already consumed Berry at the end of the next turn.",
    "desc": "When the Pokémon eats a Berry, it will regurgitate that Berry at the end of the next turn and eat it one more time.",
    "id": "cud-chew",
    "searchTerms": [
      "cud",
      "chew"
    ]
  },
  {
    "name": "Curious Medicine",
    "effect": "Resets all stat changes upon entering battlefield.\n",
    "desc": "When the Pokémon enters a battle, it scatters medicine from its shell, which removes all stat changes from allies.",
    "id": "curious-medicine",
    "searchTerms": [
      "curious",
      "medicine"
    ]
  },
  {
    "name": "Cursed Body",
    "effect": "May disable a move used on the Pokémon.\n",
    "desc": "May disable a move that has dealt damage to the Pokémon.",
    "id": "cursed-body",
    "searchTerms": [
      "cursed",
      "body"
    ]
  },
  {
    "name": "Cute Charm",
    "effect": "If a Pokémon with Cute Charm is hit by a move that makes contact, there is a 30% chance the attacker will become infatuated. It will not infatuate Pokémon of the same gender, genderless Pokémon, nor those with the ability Oblivious.",
    "desc": "The Pokémon may infatuate attackers that make direct contact with it.",
    "id": "cute-charm",
    "searchTerms": [
      "cute",
      "charm"
    ]
  },
  {
    "name": "Damp",
    "effect": "Damp prevents all Pokémon on the field from using the moves Selfdestruct and Explosion. It also prevents damage (to the Damp Pokémon only) from the ability Aftermath.",
    "desc": "The Pokémon dampens its surroundings, preventing all Pokémon from using explosive moves such as Self-Destruct.",
    "id": "damp",
    "searchTerms": [
      "damp"
    ]
  },
  {
    "name": "Dancer",
    "effect": "When another Pokémon on the field uses any Dance move, Dancer causes the ability-bearer to use that same move immediately afterward. They will still use their own move originally selected, at the usual time (e.g. after the opponent if they are slower).",
    "desc": "Whenever a dance move is used in battle, the Pokémon will copy the user to immediately perform that dance move itself.",
    "id": "dancer",
    "searchTerms": [
      "dancer"
    ]
  },
  {
    "name": "Dauntless Shield",
    "effect": "Boosts Defense in battle.\n",
    "desc": "Boosts the Pokémon's Defense stat the first time the Pokémon enters a battle.",
    "id": "dauntless-shield",
    "searchTerms": [
      "dauntless",
      "shield"
    ]
  },
  {
    "name": "Dazzling",
    "effect": "Dazzling makes the Pokémon immune to high-priority moves (i.e. those with a priority above 0).",
    "desc": "The Pokémon dazzles its opponents, making them unable to use priority moves against the Pokémon or its allies.",
    "id": "dazzling",
    "searchTerms": [
      "dazzling"
    ]
  },
  {
    "name": "Defiant",
    "effect": "Defiant raises the ability-bearer's Attack by two stages when hit by a stat-lowering move.",
    "desc": "If the Pokémon has any stat lowered by an opposing Pokémon, its Attack stat will be boosted sharply.",
    "id": "defiant",
    "searchTerms": [
      "defiant"
    ]
  },
  {
    "name": "Desolate Land",
    "effect": "Desolate Land creates extremely harsh sunlight when the ability is activated (by Groudon reverting to its Primal form).",
    "desc": "The Pokémon changes the weather to nullify Water-type attacks.",
    "id": "desolate-land",
    "searchTerms": [
      "desolate",
      "land"
    ]
  },
  {
    "name": "Disguise",
    "effect": "Disguise allows the bearer to avoid damage for one attack, in a similar way to Substitute.",
    "desc": "Once per battle, the shroud that covers the Pokémon can protect it from an attack.",
    "id": "disguise",
    "searchTerms": [
      "disguise"
    ]
  },
  {
    "name": "Download",
    "effect": "Download raises either the bearer's Attack or Special Attack by one stage when switching into battle, base on the opponent's defenses.",
    "desc": "The Pokémon compares an opposing Pokémon's Defense and Sp. Def stats before raising its own Attack or Sp. Atk stat—whichever will be more effective.",
    "id": "download",
    "searchTerms": [
      "download"
    ]
  },
  {
    "name": "Dragon's Maw",
    "effect": "Dragon's Maw increases the power of Dragon-type moves used by this Pokémon by 50%.",
    "desc": "Powers up Dragon-type moves.",
    "id": "dragons-maw",
    "searchTerms": [
      "dragons",
      "maw"
    ]
  },
  {
    "name": "Drizzle",
    "effect": "Drizzle creates a rain shower when the ability-bearer enters battle. The effect lasts 5 turns, unless it is cleared via Air Lock or Cloud Nine or replaced by another weather condition.",
    "desc": "The Pokémon makes it rain when it enters a battle.",
    "id": "drizzle",
    "searchTerms": [
      "drizzle"
    ]
  },
  {
    "name": "Drought",
    "effect": "Drought creates harsh sunlight when the ability-bearer enters battle. The effect lasts 5 turns, unless it is cleared via Air Lock or Cloud Nine or replaced by another weather condition.",
    "desc": "Turns the sunlight harsh when the Pokémon enters a battle.",
    "id": "drought",
    "searchTerms": [
      "drought"
    ]
  },
  {
    "name": "Dry Skin",
    "effect": "Dry Skin causes several effects:\nWhen hit by a Water-type attack, instead of damage it heals 1⁄4 of this Pokémon's maximum HP.\nWhen hit by a Fire-type attack, it does 25% more damage.\nDuring bright sunshine the Pokémon loses 1⁄8 of its maximum HP each turn.\nDuring rain the Pokémon recovers 1⁄8 of its maximum HP each turn.\n",
    "desc": "Restores the Pokémon's HP in rain or when it is hit by Water-type moves. Reduces HP in harsh sunlight, and increases the damage received from Fire-type moves.",
    "id": "dry-skin",
    "searchTerms": [
      "dry",
      "skin"
    ]
  },
  {
    "name": "Early Bird",
    "effect": "The Pokémon awakens quickly from sleep.\n",
    "desc": "The Pokémon awakens from sleep twice as fast as other Pokémon.",
    "id": "early-bird",
    "searchTerms": [
      "early",
      "bird"
    ]
  },
  {
    "name": "Earth Eater",
    "effect": "Restores HP when hit by a Ground-type move.\n",
    "desc": "If hit by a Ground-type move, the Pokémon has its HP restored instead of taking damage.",
    "id": "earth-eater",
    "searchTerms": [
      "earth",
      "eater"
    ]
  },
  {
    "name": "Effect Spore",
    "effect": "Contact may poison or cause paralysis or sleep.\n",
    "desc": "Contact with the Pokémon may inflict poison, sleep, or paralysis on the attacker.",
    "id": "effect-spore",
    "searchTerms": [
      "effect",
      "spore"
    ]
  },
  {
    "name": "Electric Surge",
    "effect": "Electric Surge creates a low-lying electric field, like the move Electric Terrain, when the Pokémon enters battle. It prevents grounded Pokémon from falling asleep, and increases the power of Electric type attacks.",
    "desc": "Turns the ground into Electric Terrain when the Pokémon enters a battle.",
    "id": "electric-surge",
    "searchTerms": [
      "electric",
      "surge"
    ]
  },
  {
    "name": "Electromorphosis",
    "effect": "If a Pokémon with Electromorphosis is hit by an attack, the power of the next Electric-type move it uses is doubled.",
    "desc": "The Pokémon becomes charged when it takes damage, boosting the power of the next Electric-type move the Pokémon uses.",
    "id": "electromorphosis",
    "searchTerms": [
      "electromorphosis"
    ]
  },
  {
    "name": "Filter",
    "effect": "Filter reduces the damage taken from super-effective attacks by 25%.",
    "desc": "Reduces the power of supereffective attacks that hit the Pokémon.",
    "id": "filter",
    "searchTerms": [
      "filter"
    ]
  },
  {
    "name": "Flame Body",
    "effect": "If a Pokémon with Flame Body is hit by a move that makes contact, there is a 30% chance the attacker will become burned.",
    "desc": "Contact with the Pokémon may burn the attacker.",
    "id": "flame-body",
    "searchTerms": [
      "flame",
      "body"
    ]
  },
  {
    "name": "Flare Boost",
    "effect": "Powers up special attacks when burned.\n",
    "desc": "Powers up special moves when the Pokémon is burned.",
    "id": "flare-boost",
    "searchTerms": [
      "flare",
      "boost"
    ]
  },
  {
    "name": "Flash Fire",
    "effect": "When a Pokémon with Flash Fire is hit by a Fire-type move, it does not deal damage but instead raises the power of the bearer's Fire-type moves by 50%. Subsequent hits do not raise the power even more, but the effect remains while the ability-bearer is in battle.",
    "desc": "If hit by a Fire-type move, the Pokémon absorbs the flames and uses them to power up its own Fire-type moves.",
    "id": "flash-fire",
    "searchTerms": [
      "flash",
      "fire"
    ]
  },
  {
    "name": "Flower Veil",
    "effect": "Flower Veil prevents ally Grass-type Pokémon's stats from being lowered, in double and triple battles.",
    "desc": "Ally Grass-type Pokémon are protected from status conditions and the lowering of their stats.",
    "id": "flower-veil",
    "searchTerms": [
      "flower",
      "veil"
    ]
  },
  {
    "name": "Fluffy",
    "effect": "Fluffy reduces damage from contact moves by 50%, but Fire-type moves do double damage. Fire-type moves that make contact do regular damage.",
    "desc": "Halves the damage taken from moves that make direct contact, but doubles that of Fire-type moves.",
    "id": "fluffy",
    "searchTerms": [
      "fluffy"
    ]
  },
  {
    "name": "Forewarn",
    "effect": "Determines what moves a foe has.\n",
    "desc": "When it enters a battle, the Pokémon can tell one of the moves an opposing Pokémon has.",
    "id": "forewarn",
    "searchTerms": [
      "forewarn"
    ]
  },
  {
    "name": "Friend Guard",
    "effect": "Reduces damage done to allies.\n",
    "desc": "Reduces damage dealt to allies.",
    "id": "friend-guard",
    "searchTerms": [
      "friend",
      "guard"
    ]
  },
  {
    "name": "Frisk",
    "effect": "The Pokémon can check a foe's held item.\n",
    "desc": "When it enters a battle, the Pokémon can check an opposing Pokémon's held item.",
    "id": "frisk",
    "searchTerms": [
      "frisk"
    ]
  },
  {
    "name": "Full Metal Body",
    "effect": "Prevents other Pokémon from lowering its stats.\n",
    "desc": "Prevents other Pokémon's moves or Abilities from lowering the Pokémon's stats.",
    "id": "full-metal-body",
    "searchTerms": [
      "full",
      "metal",
      "body"
    ]
  },
  {
    "name": "Fur Coat",
    "effect": "Fur Coat reduces damage taken from physical attacks by 50%.",
    "desc": "Halves the damage from physical moves.",
    "id": "fur-coat",
    "searchTerms": [
      "fur",
      "coat"
    ]
  },
  {
    "name": "Gale Wings",
    "effect": "Gives priority to Flying-type moves.\n",
    "desc": "Gives priority to the Pokémon's Flying-type moves while its HP is full.",
    "id": "gale-wings",
    "searchTerms": [
      "gale",
      "wings"
    ]
  },
  {
    "name": "Galvanize",
    "effect": "Normal-type moves become Electric-type moves and their power boosted.\n",
    "desc": "Normal-type moves become Electric-type moves. The power of those moves is boosted a little.",
    "id": "galvanize",
    "searchTerms": [
      "galvanize"
    ]
  },
  {
    "name": "Gluttony",
    "effect": "A Pokémon with Gluttony will use a pinch berry when its HP drops to 50%, rather than the usual 25%.",
    "desc": "If the Pokémon is holding a Berry to be eaten when its HP is low, it will instead eat the Berry when its HP drops to half or less.",
    "id": "gluttony",
    "searchTerms": [
      "gluttony"
    ]
  },
  {
    "name": "Good as Gold",
    "effect": "Gives immunity to status moves.\n",
    "desc": "A body of pure, solid gold gives the Pokémon full immunity to other Pokémon's status moves.",
    "id": "good-as-gold",
    "searchTerms": [
      "good",
      "as",
      "gold"
    ]
  },
  {
    "name": "Gooey",
    "effect": "Contact with the Pokémon lowers the attacker's Speed stat.\n",
    "desc": "Contact with the Pokémon lowers the attacker's Speed stat.",
    "id": "gooey",
    "searchTerms": [
      "gooey"
    ]
  },
  {
    "name": "Grass Pelt",
    "effect": "Boosts the Defense stat in Grassy Terrain.\n",
    "desc": "Boosts the Pokémon's Defense stat on Grassy Terrain.",
    "id": "grass-pelt",
    "searchTerms": [
      "grass",
      "pelt"
    ]
  },
  {
    "name": "Grassy Surge",
    "effect": "Grassy Surge creates a low-lying grassy field, like the move Grassy Terrain, when the Pokémon enters battle. It restores the HP of grounded Pokémon each turn and increases the power of Grass type attacks.",
    "desc": "Turns the ground into Grassy Terrain when the Pokémon enters a battle.",
    "id": "grassy-surge",
    "searchTerms": [
      "grassy",
      "surge"
    ]
  },
  {
    "name": "Grim Neigh",
    "effect": "Boosts Special Attack after knocking out a Pokémon.\n",
    "desc": "When the Pokémon knocks out a target, it utters a terrifying neigh, which boosts its Sp. Atk stat.",
    "id": "grim-neigh",
    "searchTerms": [
      "grim",
      "neigh"
    ]
  },
  {
    "name": "Guard Dog",
    "effect": "Boosts Attack if intimidated, and prevents being forced to switch out.\n",
    "desc": "Boosts the Pokémon's Attack stat if intimidated. Moves and items that would force the Pokémon to switch out also fail to work.",
    "id": "guard-dog",
    "searchTerms": [
      "guard",
      "dog"
    ]
  },
  {
    "name": "Gulp Missile",
    "effect": "Gulp Missile is the signature ability of Cramorant. If Cramorant uses the move Surf or Dive, it returns with a fish in its mouth. If Cramorant then takes damage, it retaliates by spitting out the fish, dealing extra damage.",
    "desc": "When the Pokémon uses Surf or Dive, it will come back with prey. When it takes damage, it will spit out the prey to attack.",
    "id": "gulp-missile",
    "searchTerms": [
      "gulp",
      "missile"
    ]
  },
  {
    "name": "Guts",
    "effect": "Guts raises the ability-bearer's Attack by 50% when inflicted by a major status ailment (poison, burn, paralysis, freeze or sleep). If burnt, the Pokémon does not suffer the usual drop in Attack.",
    "desc": "It's so gutsy that having a status condition boosts the Pokémon's Attack stat.",
    "id": "guts",
    "searchTerms": [
      "guts"
    ]
  },
  {
    "name": "Hadron Engine",
    "effect": "Creates an Electric Terrain when entering battle, and boosts Special Attack while active.\n",
    "desc": "Turns the ground into Electric Terrain when the Pokémon enters a battle. The futuristic engine within the Pokémon also boosts its Sp. Atk stat on Electric Terrain.",
    "id": "hadron-engine",
    "searchTerms": [
      "hadron",
      "engine"
    ]
  },
  {
    "name": "Harvest",
    "effect": "May create another Berry after one is used.\n",
    "desc": "May create another Berry after one is used.",
    "id": "harvest",
    "searchTerms": [
      "harvest"
    ]
  },
  {
    "name": "Healer",
    "effect": "May heal an ally's status conditions.\n",
    "desc": "Sometimes cures the status conditions of the Pokémon's allies.",
    "id": "healer",
    "searchTerms": [
      "healer"
    ]
  },
  {
    "name": "Heatproof",
    "effect": "Heatproof reduces the damage taken from Fire-type moves by 50%. It also halves the damage from a burn, from 1⁄8 to 1⁄16 of the Pokémon's maximum HP.",
    "desc": "The Pokémon's heatproof body halves the damage taken from Fire-type moves.",
    "id": "heatproof",
    "searchTerms": [
      "heatproof"
    ]
  },
  {
    "name": "Heavy Metal",
    "effect": "Heavy Metal doubles the Pokémon's weight in battle. Increasing weight affects these moves:",
    "desc": "Doubles the Pokémon's weight.",
    "id": "heavy-metal",
    "searchTerms": [
      "heavy",
      "metal"
    ]
  },
  {
    "name": "Honey Gather",
    "effect": "Honey Gather has no effect in battle.",
    "desc": "The Pokémon may gather Honey after a battle.",
    "id": "honey-gather",
    "searchTerms": [
      "honey",
      "gather"
    ]
  },
  {
    "name": "Hospitality",
    "effect": "When the Pokémon enters a battle, it showers its ally with hospitality, restoring a small amount of the ally's HP.",
    "desc": "When the Pokémon enters a battle, it showers its ally with hospitality, restoring a small amount of the ally's HP.",
    "id": "hospitality",
    "searchTerms": [
      "hospitality"
    ]
  },
  {
    "name": "Huge Power",
    "effect": "Raises the Pokémon's Attack stat.",
    "desc": "Doubles the Pokémon's Attack stat.",
    "id": "huge-power",
    "searchTerms": [
      "huge",
      "power"
    ]
  },
  {
    "name": "Hunger Switch",
    "effect": "Hunger Switch causes Morpeko to change its form each turn, alternating between Full Belly Mode and Hangry Mode. Morpeko's form also changes the type of its signature move, Aura Wheel.",
    "desc": "The Pokémon changes its form, alternating between its Full Belly Mode and Hangry Mode after the end of every turn.",
    "id": "hunger-switch",
    "searchTerms": [
      "hunger",
      "switch"
    ]
  },
  {
    "name": "Hustle",
    "effect": "Hustle increases the ability-bearer's Attack by 50%, however, it also reduces the Accuracy of all Physical moves by 20%.",
    "desc": "Boosts the Pokémon's Attack stat but lowers its accuracy.",
    "id": "hustle",
    "searchTerms": [
      "hustle"
    ]
  },
  {
    "name": "Hydration",
    "effect": "A Pokémon with Hydration will cure itself of any status conditions during rain, at the end of each turn. This includes self-inflicted conditions such as from using Rest.",
    "desc": "Cures the Pokémon's status conditions in rain.",
    "id": "hydration",
    "searchTerms": [
      "hydration"
    ]
  },
  {
    "name": "Hyper Cutter",
    "effect": "Hyper Cutter prevents the bearer's Attack stat from being lowered by other Pokémon, through moves such as Growl or abilities such as Intimidate.",
    "desc": "The Pokémon's prized, mighty pincers prevent other Pokémon from lowering its Attack stat.",
    "id": "hyper-cutter",
    "searchTerms": [
      "hyper",
      "cutter"
    ]
  },
  {
    "name": "Ice Body",
    "effect": "A Pokémon with Ice Body will recover 1⁄16 of its maximum HP during hail, after each turn. It also grants immunity to the hailstorm damage, if not already immune.",
    "desc": "The Pokémon gradually regains HP in snow.",
    "id": "ice-body",
    "searchTerms": [
      "ice",
      "body"
    ]
  },
  {
    "name": "Ice Face",
    "effect": "Ice Face is the signature ability of Eiscue. It allows the Pokémon to take a physical attack without taking damage. After the attack, Eiscue changes to its No Ice Face form, however, it can be restored in hail.",
    "desc": "The Pokémon's ice head can take a physical attack as a substitute, but the attack also changes the Pokémon's appearance. The ice will be restored when it snows.",
    "id": "ice-face",
    "searchTerms": [
      "ice",
      "face"
    ]
  },
  {
    "name": "Ice Scales",
    "effect": "Halves damage from Special moves.\n",
    "desc": "The Pokémon is protected by ice scales, which halve the damage taken from special moves.",
    "id": "ice-scales",
    "searchTerms": [
      "ice",
      "scales"
    ]
  },
  {
    "name": "Illuminate",
    "effect": "Illuminate has no effect in battle.",
    "desc": "Raises the likelihood of meeting wild Pokémon by illuminating the surroundings.",
    "id": "illuminate",
    "searchTerms": [
      "illuminate"
    ]
  },
  {
    "name": "Illusion",
    "effect": "When a Pokémon with the Illusion ability switches into battle, it takes the form of the Pokémon in last place (6th) of the player's party. Illusion will not activate if the Pokémon in last place is the same species or is fainted.",
    "desc": "The Pokémon fools opponents by entering battle disguised as the last Pokémon in its Trainer's party.",
    "id": "illusion",
    "searchTerms": [
      "illusion"
    ]
  },
  {
    "name": "Immunity",
    "effect": "Prevents the Pokémon from getting poisoned.\n",
    "desc": "The Pokémon's immune system prevents it from being poisoned.",
    "id": "immunity",
    "searchTerms": [
      "immunity"
    ]
  },
  {
    "name": "Imposter",
    "effect": "It transforms itself into the Pokémon it is facing.\n",
    "desc": "The Pokémon transforms itself into the Pokémon it's facing.",
    "id": "imposter",
    "searchTerms": [
      "imposter"
    ]
  },
  {
    "name": "Infiltrator",
    "effect": "Infiltrator ignores the effects of Reflect, Light Screen and Safeguard. In other words, if the opponent has used Safeguard, Toxic would still badly poison them.",
    "desc": "The Pokémon's moves are unaffected by the target's barriers, substitutes, and the like.",
    "id": "infiltrator",
    "searchTerms": [
      "infiltrator"
    ]
  },
  {
    "name": "Inner Focus",
    "effect": "Inner Focus prevents the Pokémon from flinching, for example when attacked by a move like Headbutt.",
    "desc": "The Pokémon's intense focus prevents it from flinching or being affected by Intimidate.",
    "id": "inner-focus",
    "searchTerms": [
      "inner",
      "focus"
    ]
  },
  {
    "name": "Insomnia",
    "effect": "Insomnia prevents the ability-bearer from falling asleep, both from moves by other Pokémon like Sing, and self-inflicted sleep like Rest.",
    "desc": "The Pokémon's insomnia prevents it from falling asleep.",
    "id": "insomnia",
    "searchTerms": [
      "insomnia"
    ]
  },
  {
    "name": "Intimidate",
    "effect": "Intimidate lower's the Attack of all opponents by one stage when the ability-bearer switches in (including the start of a battle).",
    "desc": "When the Pokémon enters a battle, it intimidates opposing Pokémon and makes them cower, lowering their Attack stats.",
    "id": "intimidate",
    "searchTerms": [
      "intimidate"
    ]
  },
  {
    "name": "Intrepid Sword",
    "effect": "Boosts Attack in battle.\n",
    "desc": "Boosts the Pokémon's Attack stat the first time the Pokémon enters a battle.",
    "id": "intrepid-sword",
    "searchTerms": [
      "intrepid",
      "sword"
    ]
  },
  {
    "name": "Iron Fist",
    "effect": "Iron Fist increases the power of all punching moves by 20%.",
    "desc": "Powers up punching moves.",
    "id": "iron-fist",
    "searchTerms": [
      "iron",
      "fist"
    ]
  },
  {
    "name": "Justified",
    "effect": "Justified raises the ability-bearer's Attack by one stage when hit by a damaging Dark-type move.",
    "desc": "When the Pokémon is hit by a Dark-type attack, its Attack stat is boosted by its sense of justice.",
    "id": "justified",
    "searchTerms": [
      "justified"
    ]
  },
  {
    "name": "Keen Eye",
    "effect": "Keen Eye prevents the Pokémon from losing accuracy, for example from moves like Sand-Attack.",
    "desc": "The Pokémon's keen eyes prevent its accuracy from being lowered.",
    "id": "keen-eye",
    "searchTerms": [
      "keen",
      "eye"
    ]
  },
  {
    "name": "Klutz",
    "effect": "The Pokémon can't use any held items.\n",
    "desc": "The Pokémon can't use any held items.",
    "id": "klutz",
    "searchTerms": [
      "klutz"
    ]
  },
  {
    "name": "Leaf Guard",
    "effect": "Leaf Guard prevents the bearer from succumbing to major status ailments (sleep, burns, poisoning, paralysis or freezing) during sunny weather.",
    "desc": "Prevents status conditions in harsh sunlight.",
    "id": "leaf-guard",
    "searchTerms": [
      "leaf",
      "guard"
    ]
  },
  {
    "name": "Levitate",
    "effect": "Levitate causes the Pokémon to be raised (like Flying-type Pokémon).",
    "desc": "By floating in the air, the Pokémon receives full immunity to all Ground-type moves.",
    "id": "levitate",
    "searchTerms": [
      "levitate"
    ]
  },
  {
    "name": "Libero",
    "effect": "Libero changes the Pokémon's type to that of its previously used attack.",
    "desc": "Changes the Pokémon's type to the type of the move it's about to use. This works only once each time the Pokémon enters battle.",
    "id": "libero",
    "searchTerms": [
      "libero"
    ]
  },
  {
    "name": "Light Metal",
    "effect": "Light Metal halves the Pokémon's weight in battle. Decreasing weight affects these moves:",
    "desc": "Halves the Pokémon's weight.",
    "id": "light-metal",
    "searchTerms": [
      "light",
      "metal"
    ]
  },
  {
    "name": "Lightning Rod",
    "effect": "Lightning Rod forces all single-target Electric-type moves - used by any other Pokémon on the field - to target this Pokémon, and with 100% accuracy. This includes the status move Thunder Wave. The ability is most useful in double/triple battles.",
    "desc": "The Pokémon draws in all Electric-type moves. Instead of taking damage from them, its Sp. Atk stat is boosted.",
    "id": "lightning-rod",
    "searchTerms": [
      "lightning",
      "rod"
    ]
  },
  {
    "name": "Limber",
    "effect": "The Pokémon is protected from paralysis.\n",
    "desc": "The Pokémon's limber body prevents it from being paralyzed.",
    "id": "limber",
    "searchTerms": [
      "limber"
    ]
  },
  {
    "name": "Lingering Aroma",
    "effect": "Contact changes the attacker's Ability to Lingering Aroma.\n",
    "desc": "Contact with the Pokémon changes the attacker's Ability to Lingering Aroma.",
    "id": "lingering-aroma",
    "searchTerms": [
      "lingering",
      "aroma"
    ]
  },
  {
    "name": "Liquid Ooze",
    "effect": "Damages attackers using any draining move.\n",
    "desc": "The strong stench of the Pokémon's oozed liquid damages attackers that use HP-draining moves.",
    "id": "liquid-ooze",
    "searchTerms": [
      "liquid",
      "ooze"
    ]
  },
  {
    "name": "Liquid Voice",
    "effect": "Liquid Voice causes all sound-based moves used by the Pokémon to become Water type. Water type Pokémon also gain STAB from those moves.",
    "desc": "Sound-based moves become Water-type moves.",
    "id": "liquid-voice",
    "searchTerms": [
      "liquid",
      "voice"
    ]
  },
  {
    "name": "Long Reach",
    "effect": "The Pokémon uses its moves without making contact with the target.\n",
    "desc": "The Pokémon uses its moves without making contact with the target.",
    "id": "long-reach",
    "searchTerms": [
      "long",
      "reach"
    ]
  },
  {
    "name": "Magic Bounce",
    "effect": "Reflects status- changing moves.\n",
    "desc": "The Pokémon reflects status moves instead of getting hit by them.",
    "id": "magic-bounce",
    "searchTerms": [
      "magic",
      "bounce"
    ]
  },
  {
    "name": "Magic Guard",
    "effect": "Magic Guard protects the Pokémon from indirect damage, including:\nDamage from the Poison status condition\nDamage from a Burn (though the Attack drop still occurs)\nDamage from Leech Seed or Curse\nWeather damage (hail or sandstorm)\nRecoil damage (e.g. from Head Charge)\nCrash damage from Jump Kick or High Jump Kick\nDamage from Spikes or Stealth Rocks when switching in (Toxic Spikes still poisons the Pokémon but they will not lose HP)\nHP loss from Life Orb (though the move boosts still occur)\nIt does not prevent damage from confusion, trapping moves (e.g. Bind) or Struggle.ChangesIn Generation 4 a Pokémon with Magic Guard cannot be poisoned from Toxic Spikes, nor become fully immobile through paralysis (though the Speed drop still occurs).",
    "desc": "The Pokémon only takes damage from attacks.",
    "id": "magic-guard",
    "searchTerms": [
      "magic",
      "guard"
    ]
  },
  {
    "name": "Magician",
    "effect": "The Pokémon steals the held item of a Pokémon it hits with a move.\n",
    "desc": "The Pokémon steals the held item from any target it hits with a move.",
    "id": "magician",
    "searchTerms": [
      "magician"
    ]
  },
  {
    "name": "Magma Armor",
    "effect": "Magma Armor prevents the Pokémon from becoming frozen, for example from moves like Blizzard.",
    "desc": "The Pokémon's hot magma coating prevents it from being frozen.",
    "id": "magma-armor",
    "searchTerms": [
      "magma",
      "armor"
    ]
  },
  {
    "name": "Magnet Pull",
    "effect": "Magnet Pull prevents Steel type Pokémon from switching out of battle or fleeing.",
    "desc": "Prevents Steel-type Pokémon from fleeing by pulling them in with magnetism.",
    "id": "magnet-pull",
    "searchTerms": [
      "magnet",
      "pull"
    ]
  },
  {
    "name": "Marvel Scale",
    "effect": "Marvel Scale raises the ability-bearer's Defense by 50% when inflicted by a major status ailment (poison, burn, paralysis, freeze or sleep).",
    "desc": "The Pokémon's marvelous scales boost its Defense stat if it has a status condition.",
    "id": "marvel-scale",
    "searchTerms": [
      "marvel",
      "scale"
    ]
  },
  {
    "name": "Mega Launcher",
    "effect": "Mega Launcher increases the power of all aura and pulse moves by 50%. Heal Pulse boosts the HP restored by 50%.",
    "desc": "Powers up pulse moves.",
    "id": "mega-launcher",
    "searchTerms": [
      "mega",
      "launcher"
    ]
  },
  {
    "name": "Merciless",
    "effect": "The Pokémon's attacks become critical hits if the target is poisoned.\n",
    "desc": "The Pokémon's attacks become critical hits if the target is poisoned.",
    "id": "merciless",
    "searchTerms": [
      "merciless"
    ]
  },
  {
    "name": "Mind's Eye",
    "effect": "The Pokémon ignores changes to opponents' evasiveness, its accuracy can't be lowered, and it can hit Ghost types with Normal- and Fighting-type moves.",
    "desc": "The Pokémon ignores changes to opponents' evasiveness, its accuracy can't be lowered, and it can hit Ghost types with Normal- and Fighting-type moves.",
    "id": "minds-eye",
    "searchTerms": [
      "minds",
      "eye"
    ]
  },
  {
    "name": "Minus",
    "effect": "Ups Sp. Atk if another Pokémon has Plus or Minus.\n",
    "desc": "Boosts the Sp. Atk stat of the Pokémon if an ally with the Plus or Minus Ability is also in battle.",
    "id": "minus",
    "searchTerms": [
      "minus"
    ]
  },
  {
    "name": "Mirror Armor",
    "effect": "Reflects any stat-lowering effects.\n",
    "desc": "Bounces back only the stat-lowering effects that the Pokémon receives.",
    "id": "mirror-armor",
    "searchTerms": [
      "mirror",
      "armor"
    ]
  },
  {
    "name": "Misty Surge",
    "effect": "Misty Surge creates a low-lying mist, like the move Misty Terrain, when the bearer enters battle. It protects all grounded Pokémon from status conditions and halves the power of Dragon type attacks.",
    "desc": "Turns the ground into Misty Terrain when the Pokémon enters a battle.",
    "id": "misty-surge",
    "searchTerms": [
      "misty",
      "surge"
    ]
  },
  {
    "name": "Mold Breaker",
    "effect": "Mold Breaker prevents a target's ability from affecting moves that the Mold Breaker Pokémon uses. It only affects abilities that change the power, accuracy or other effects of moves.",
    "desc": "The Pokémon's moves are unimpeded by the Ability of the target.",
    "id": "mold-breaker",
    "searchTerms": [
      "mold",
      "breaker"
    ]
  },
  {
    "name": "Moody",
    "effect": "Raises one stat and lowers another.\n",
    "desc": "Every turn, one of the Pokémon's stats will be boosted sharply but another stat will be lowered.",
    "id": "moody",
    "searchTerms": [
      "moody"
    ]
  },
  {
    "name": "Motor Drive",
    "effect": "Raises Speed if hit by an Electric-type move.\n",
    "desc": "The Pokémon takes no damage when hit by Electric-type moves. Instead, its Speed stat is boosted.",
    "id": "motor-drive",
    "searchTerms": [
      "motor",
      "drive"
    ]
  },
  {
    "name": "Moxie",
    "effect": "Moxie increases the user's Attack one stage upon fainting an opponent.",
    "desc": "When the Pokémon knocks out a target, it shows moxie, which boosts its Attack stat.",
    "id": "moxie",
    "searchTerms": [
      "moxie"
    ]
  },
  {
    "name": "Multiscale",
    "effect": "Reduces damage when HP is full.\n",
    "desc": "Reduces the amount of damage the Pokémon takes while its HP is full.",
    "id": "multiscale",
    "searchTerms": [
      "multiscale"
    ]
  },
  {
    "name": "Multitype",
    "effect": "Multitype changes the ability-bearer's type if it is holding one of the Type Plate items. Moves of the corresponding type receive STAB.",
    "desc": "Changes the Pokémon's type to match the plate it holds.",
    "id": "multitype",
    "searchTerms": [
      "multitype"
    ]
  },
  {
    "name": "Mycelium Might",
    "effect": "Status moves go last, but are not affected by the opponent's ability.\n",
    "desc": "The Pokémon will always act more slowly when using status moves, but these moves will be unimpeded by the Ability of the target.",
    "id": "mycelium-might",
    "searchTerms": [
      "mycelium",
      "might"
    ]
  },
  {
    "name": "Natural Cure",
    "effect": "All status problems heal when it switches out.\n",
    "desc": "The Pokémon's status conditions are cured when it switches out.",
    "id": "natural-cure",
    "searchTerms": [
      "natural",
      "cure"
    ]
  },
  {
    "name": "Neuroforce",
    "effect": "Powers up moves that are super effective.\n",
    "desc": "Powers up the Pokémon's supereffective attacks even further.",
    "id": "neuroforce",
    "searchTerms": [
      "neuroforce"
    ]
  },
  {
    "name": "Neutralizing Gas",
    "effect": "Neutralizes abilities of all Pokémon in battle.",
    "desc": "While the Pokémon is in the battle, the effects of all other Pokémon's Abilities will be nullified or will not be triggered.",
    "id": "neutralizing-gas",
    "searchTerms": [
      "neutralizing",
      "gas"
    ]
  },
  {
    "name": "No Guard",
    "effect": "No Guard ensures that all attacks used by, and targeted at, the ability-bearer hit without fail.",
    "desc": "The Pokémon employs no-guard tactics to ensure incoming and outgoing attacks always land.",
    "id": "no-guard",
    "searchTerms": [
      "no",
      "guard"
    ]
  },
  {
    "name": "Oblivious",
    "effect": "Oblivious makes the Pokémon immune to gender-based moves and abilities, specifically Attract, Captivate and Cute Charm.",
    "desc": "The Pokémon is oblivious, keeping it from being infatuated, falling for taunts, or being affected by Intimidate.",
    "id": "oblivious",
    "searchTerms": [
      "oblivious"
    ]
  },
  {
    "name": "Opportunist",
    "effect": "Copies stat boosts by the opponent.\n",
    "desc": "If an opponent's stat is boosted, the Pokémon seizes the opportunity to boost the same stat for itself.",
    "id": "opportunist",
    "searchTerms": [
      "opportunist"
    ]
  },
  {
    "name": "Orichalcum Pulse",
    "effect": "Turns the sunlight harsh when entering battle, and boosts Attack while active.\n",
    "desc": "Turns the sunlight harsh when the Pokémon enters a battle. The ancient pulse thrumming through the Pokémon also boosts its Attack stat in harsh sunlight.",
    "id": "orichalcum-pulse",
    "searchTerms": [
      "orichalcum",
      "pulse"
    ]
  },
  {
    "name": "Overcoat",
    "effect": "Overcoat makes the Pokémon immune to residual damage from weather conditions (specifically Hail and Sandstorm).",
    "desc": "The Pokémon takes no damage from sandstorms. It is also protected from the effects of powders and spores.",
    "id": "overcoat",
    "searchTerms": [
      "overcoat"
    ]
  },
  {
    "name": "Overgrow",
    "effect": "Overgrow increases the power of Grass-type moves by 50% (1.5×) when the ability-bearer's HP falls below a third of its maximum (known in-game as in a pinch).",
    "desc": "Powers up Grass-type moves when the Pokémon's HP is low.",
    "id": "overgrow",
    "searchTerms": [
      "overgrow"
    ]
  },
  {
    "name": "Own Tempo",
    "effect": "Prevents the Pokémon from becoming confused.\n",
    "desc": "The Pokémon sticks to its own tempo, preventing it from becoming confused or being affected by Intimidate.",
    "id": "own-tempo",
    "searchTerms": [
      "own",
      "tempo"
    ]
  },
  {
    "name": "Pickpocket",
    "effect": "Steals an item when hit by another Pokémon.\n",
    "desc": "The Pokémon steals the held item from attackers that make direct contact with it.",
    "id": "pickpocket",
    "searchTerms": [
      "pickpocket"
    ]
  },
  {
    "name": "Pickup",
    "effect": "When another Pokémon on the field uses a single-use held item, a Pokémon with Pickup will obtain the used item (if they are not already holding anything) and it can be used again.",
    "desc": "The Pokémon may pick up an item another Pokémon used during a battle. It may pick up items outside of battle, too.",
    "id": "pickup",
    "searchTerms": [
      "pickup"
    ]
  },
  {
    "name": "Pixilate",
    "effect": "Pixilate causes all Normal-type attacking moves used by the Pokémon to become Fairy-type, and increase in power by 20%.",
    "desc": "Normal-type moves become Fairy-type moves. The power of those moves is boosted a little.",
    "id": "pixilate",
    "searchTerms": [
      "pixilate"
    ]
  },
  {
    "name": "Plus",
    "effect": "Ups Sp. Atk if another Pokémon has Plus or Minus.\n",
    "desc": "Boosts the Sp. Atk stat of the Pokémon if an ally with the Plus or Minus Ability is also in battle.",
    "id": "plus",
    "searchTerms": [
      "plus"
    ]
  },
  {
    "name": "Poison Heal",
    "effect": "Restores HP if the Pokémon is poisoned.\n",
    "desc": "If poisoned, the Pokémon has its HP restored instead of taking damage.",
    "id": "poison-heal",
    "searchTerms": [
      "poison",
      "heal"
    ]
  },
  {
    "name": "Poison Point",
    "effect": "Contact with the Pokémon may poison the attacker.\n",
    "desc": "Contact with the Pokémon may poison the attacker.",
    "id": "poison-point",
    "searchTerms": [
      "poison",
      "point"
    ]
  },
  {
    "name": "Poison Puppeteer",
    "effect": "Pokémon poisoned by Pecharunt's moves will also become confused.",
    "desc": "Pokémon poisoned by Pecharunt's moves will also become confused.",
    "id": "poison-puppeteer",
    "searchTerms": [
      "poison",
      "puppeteer"
    ]
  },
  {
    "name": "Poison Touch",
    "effect": "May poison targets when a Pokémon makes contact.\n",
    "desc": "May poison a target when the Pokémon makes contact.",
    "id": "poison-touch",
    "searchTerms": [
      "poison",
      "touch"
    ]
  },
  {
    "name": "Power of Alchemy",
    "effect": "The Pokémon copies the Ability of a defeated ally.\n",
    "desc": "The Pokémon copies the Ability of a defeated ally.",
    "id": "power-of-alchemy",
    "searchTerms": [
      "power",
      "of",
      "alchemy"
    ]
  },
  {
    "name": "Power Spot",
    "effect": "Just being next to the Pokémon powers up moves.\n",
    "desc": "Just being next to the Pokémon powers up moves.",
    "id": "power-spot",
    "searchTerms": [
      "power",
      "spot"
    ]
  },
  {
    "name": "Prankster",
    "effect": "Prankster increases the priority of status moves by +1.",
    "desc": "Gives priority to the Pokémon's status moves.",
    "id": "prankster",
    "searchTerms": [
      "prankster"
    ]
  },
  {
    "name": "Pressure",
    "effect": "Pressure makes any attack targeted at the ability-bearer - regardless of whether it hits - use 2 PP instead of 1.",
    "desc": "Puts other Pokémon under pressure, causing them to expend more PP to use their moves.",
    "id": "pressure",
    "searchTerms": [
      "pressure"
    ]
  },
  {
    "name": "Primordial Sea",
    "effect": "Primordial Sea creates heavy rain when the ability is activated (by Kyogre reverting to its Primal form).",
    "desc": "The Pokémon changes the weather to nullify Fire-type attacks.",
    "id": "primordial-sea",
    "searchTerms": [
      "primordial",
      "sea"
    ]
  },
  {
    "name": "Prism Armor",
    "effect": "Prism Armor reduces the damage taken from super-effective attacks by 25%. It is not affected by the abilities Mold Breaker, Teravolt, or Turboblaze.",
    "desc": "Reduces the power of supereffective attacks that hit the Pokémon.",
    "id": "prism-armor",
    "searchTerms": [
      "prism",
      "armor"
    ]
  },
  {
    "name": "Propeller Tail",
    "effect": "Ignores moves and abilities that draw in moves.\n",
    "desc": "Ignores the effects of opposing Pokémon's Abilities and moves that draw in moves.",
    "id": "propeller-tail",
    "searchTerms": [
      "propeller",
      "tail"
    ]
  },
  {
    "name": "Protean",
    "effect": "Protean changes the Pokémon's type to that of its previously used attack.",
    "desc": "Changes the Pokémon's type to the type of the move it's about to use. This works only once each time the Pokémon enters battle.",
    "id": "protean",
    "searchTerms": [
      "protean"
    ]
  },
  {
    "name": "Protosynthesis",
    "effect": "Raises highest stat in harsh sunlight, or if holding Booster Energy.\n",
    "desc": "Boosts the Pokémon's most proficient stat in harsh sunlight or if the Pokémon is holding Booster Energy.",
    "id": "protosynthesis",
    "searchTerms": [
      "protosynthesis"
    ]
  },
  {
    "name": "Psychic Surge",
    "effect": "Psychic Surge creates a low-lying psychic field, like the move Psychic Terrain, when the Pokémon enters battle. It prevents high-priority moves being used and increases the power of Psychic type attacks.",
    "desc": "Turns the ground into Psychic Terrain when the Pokémon enters a battle.",
    "id": "psychic-surge",
    "searchTerms": [
      "psychic",
      "surge"
    ]
  },
  {
    "name": "Punk Rock",
    "effect": "Boosts sound-based moves and halves damage from the same moves.\n",
    "desc": "Boosts the power of sound-based moves. The Pokémon also takes half the damage from these kinds of moves.",
    "id": "punk-rock",
    "searchTerms": [
      "punk",
      "rock"
    ]
  },
  {
    "name": "Pure Power",
    "effect": "Raises the Pokémon's Attack stat.\n",
    "desc": "Using its pure power, the Pokémon doubles its Attack stat.",
    "id": "pure-power",
    "searchTerms": [
      "pure",
      "power"
    ]
  },
  {
    "name": "Purifying Salt",
    "effect": "Protects from status conditions and halves damage from Ghost-type moves.\n",
    "desc": "The Pokémon's pure salt protects it from status conditions and halves the damage taken from Ghost-type moves.",
    "id": "purifying-salt",
    "searchTerms": [
      "purifying",
      "salt"
    ]
  },
  {
    "name": "Quark Drive",
    "effect": "Raises highest stat on Electric Terrain, or if holding Booster Energy.\n",
    "desc": "Boosts the Pokémon's most proficient stat on Electric Terrain or if the Pokémon is holding Booster Energy.",
    "id": "quark-drive",
    "searchTerms": [
      "quark",
      "drive"
    ]
  },
  {
    "name": "Queenly Majesty",
    "effect": "Prevents use of priority moves.",
    "desc": "The Pokémon's majesty pressures opponents and makes them unable to use priority moves against the Pokémon or its allies.",
    "id": "queenly-majesty",
    "searchTerms": [
      "queenly",
      "majesty"
    ]
  },
  {
    "name": "Quick Draw",
    "effect": "\n",
    "desc": "Enables the Pokémon to move first occasionally.",
    "id": "quick-draw",
    "searchTerms": [
      "quick",
      "draw"
    ]
  },
  {
    "name": "Quick Feet",
    "effect": "Quick Feet raises the ability-bearer's Speed by 50% when inflicted by a major status ailment (poison, burn, paralysis, freeze or sleep). If paralyzed, the Pokémon does not suffer the usual drop in Speed.",
    "desc": "Boosts the Speed stat if the Pokémon has a status condition.",
    "id": "quick-feet",
    "searchTerms": [
      "quick",
      "feet"
    ]
  },
  {
    "name": "Rain Dish",
    "effect": "A Pokémon with Rain Dish will recover 1⁄16 of its maximum HP during rain, after each turn.",
    "desc": "The Pokémon gradually regains HP in rain.",
    "id": "rain-dish",
    "searchTerms": [
      "rain",
      "dish"
    ]
  },
  {
    "name": "Rattled",
    "effect": "When a Pokémon with Rattled is hit by a Bug, Ghost or Dark type move, its Speed is raised one stage (up to the usual maximum of +6 stages).",
    "desc": "The Pokémon gets scared when hit by a Dark-, Ghost-, or Bug-type attack or if intimidated, which boosts its Speed stat.",
    "id": "rattled",
    "searchTerms": [
      "rattled"
    ]
  },
  {
    "name": "Receiver",
    "effect": "A Pokémon with Receiver will inherit the ability of a teammate in a double/triple battle when that teammate faints.",
    "desc": "The Pokémon copies the Ability of a defeated ally.",
    "id": "receiver",
    "searchTerms": [
      "receiver"
    ]
  },
  {
    "name": "Reckless",
    "effect": "Reckless increases the power of recoil moves by 20%. By extension, this means the amount of recoil damage taken will increase as more damage is dealt (except for High Jump Kick and Jump Kick which are based on the user's HP).",
    "desc": "Powers up moves that have recoil damage.",
    "id": "reckless",
    "searchTerms": [
      "reckless"
    ]
  },
  {
    "name": "Regenerator",
    "effect": "A Pokémon with Regenerator restores 1⁄3 of its maximum HP when switching out.",
    "desc": "The Pokémon has a little of its HP restored when withdrawn from battle.",
    "id": "regenerator",
    "searchTerms": [
      "regenerator"
    ]
  },
  {
    "name": "Ripen",
    "effect": "Doubles the effect of berries.\n",
    "desc": "Ripens Berries and doubles their effect.",
    "id": "ripen",
    "searchTerms": [
      "ripen"
    ]
  },
  {
    "name": "Rivalry",
    "effect": "Deals more damage to a Pokémon of same gender.\n",
    "desc": "The Pokémon's competitive spirit makes it deal more damage to Pokémon of the same gender, but less damage to Pokémon of the opposite gender.",
    "id": "rivalry",
    "searchTerms": [
      "rivalry"
    ]
  },
  {
    "name": "Rock Head",
    "effect": "Protects the Pokémon from recoil damage.\n",
    "desc": "Protects the Pokémon from recoil damage.",
    "id": "rock-head",
    "searchTerms": [
      "rock",
      "head"
    ]
  },
  {
    "name": "Rocky Payload",
    "effect": "Rocky Payload increases the power of Rock-type moves used by this Pokémon by 50%.",
    "desc": "Powers up Rock-type moves.",
    "id": "rocky-payload",
    "searchTerms": [
      "rocky",
      "payload"
    ]
  },
  {
    "name": "Rough Skin",
    "effect": "When a Pokémon with Rough Skin is hit by a move that makes contact, the attacker receives damage equal to 1⁄8 of their maximum HP.",
    "desc": "The Pokémon's rough skin damages attackers that make direct contact with it.",
    "id": "rough-skin",
    "searchTerms": [
      "rough",
      "skin"
    ]
  },
  {
    "name": "Run Away",
    "effect": "Run Away allows the bearer to flee a battle with a wild Pokémon without fail, even if the opposing Pokémon has used a move like Mean Look or Bind, or has an ability such as Arena Trap.",
    "desc": "Enables a sure getaway from wild Pokémon.",
    "id": "run-away",
    "searchTerms": [
      "run",
      "away"
    ]
  },
  {
    "name": "Sand Force",
    "effect": "Sand Force raises the power of Ground, Rock and Steel type moves by 30% during a sandstorm.",
    "desc": "Boosts the power of Rock-, Ground-, and Steel-type moves in a sandstorm.",
    "id": "sand-force",
    "searchTerms": [
      "sand",
      "force"
    ]
  },
  {
    "name": "Sand Rush",
    "effect": "Sand Rush doubles the ability-bearer's Speed during a sandstorm.",
    "desc": "Boosts the Pokémon's Speed stat in a sandstorm.",
    "id": "sand-rush",
    "searchTerms": [
      "sand",
      "rush"
    ]
  },
  {
    "name": "Sand Spit",
    "effect": "Creates a sandstorm when hit by an attack.\n",
    "desc": "The Pokémon creates a sandstorm when it's hit by an attack.",
    "id": "sand-spit",
    "searchTerms": [
      "sand",
      "spit"
    ]
  },
  {
    "name": "Sand Stream",
    "effect": "Sand Stream creates a sandstorm when the ability-bearer enters battle. The effect lasts 5 turns, unless it is cleared via Air Lock or Cloud Nine or replaced by another weather condition.",
    "desc": "The Pokémon summons a sandstorm when it enters a battle.",
    "id": "sand-stream",
    "searchTerms": [
      "sand",
      "stream"
    ]
  },
  {
    "name": "Sand Veil",
    "effect": "Sand Veil raises the ability-bearer's evasion by 20% in a sandstorm. It also gives immunity to sandstorm damage (if they are not already protected by being Ground/Rock/Steel type).",
    "desc": "Boosts the Pokémon's evasiveness in a sandstorm.",
    "id": "sand-veil",
    "searchTerms": [
      "sand",
      "veil"
    ]
  },
  {
    "name": "Sap Sipper",
    "effect": "Boosts Attack when hit by a Grass-type move.\n",
    "desc": "The Pokémon takes no damage when hit by Grass-type moves. Instead, its Attack stat is boosted.",
    "id": "sap-sipper",
    "searchTerms": [
      "sap",
      "sipper"
    ]
  },
  {
    "name": "Scrappy",
    "effect": "Enables moves to hit Ghost-type Pokémon.\n",
    "desc": "The Pokémon can hit Ghost-type Pokémon with Normal- and Fighting-type moves. It is also unaffected by Intimidate.",
    "id": "scrappy",
    "searchTerms": [
      "scrappy"
    ]
  },
  {
    "name": "Seed Sower",
    "effect": "Turns the ground into Grassy Terrain when the Pokémon is hit by an attack.\n",
    "desc": "Turns the ground into Grassy Terrain when the Pokémon is hit by an attack.",
    "id": "seed-sower",
    "searchTerms": [
      "seed",
      "sower"
    ]
  },
  {
    "name": "Serene Grace",
    "effect": "Serene Grace doubles the chance of moves' secondary effects occurring - specifically stat changes, status ailments, or flinching. It also increases the chance of flinching due to the held items King's Rock and Razor Fang from 10% to 20% (however, note that those items do not affect moves that already have a flinch chance).",
    "desc": "Raises the likelihood of additional effects occurring when the Pokémon uses its moves.",
    "id": "serene-grace",
    "searchTerms": [
      "serene",
      "grace"
    ]
  },
  {
    "name": "Shadow Shield",
    "effect": "Reduces damage when HP is full.\n",
    "desc": "Reduces the amount of damage the Pokémon takes while its HP is full.",
    "id": "shadow-shield",
    "searchTerms": [
      "shadow",
      "shield"
    ]
  },
  {
    "name": "Shadow Tag",
    "effect": "Prevents the foe from escaping.\n",
    "desc": "The Pokémon steps on the opposing Pokémon's shadows to prevent them from fleeing or switching out.",
    "id": "shadow-tag",
    "searchTerms": [
      "shadow",
      "tag"
    ]
  },
  {
    "name": "Sharpness",
    "effect": "Sharpness increases the power of all slicing moves by 50%.",
    "desc": "Powers up slicing moves.",
    "id": "sharpness",
    "searchTerms": [
      "sharpness"
    ]
  },
  {
    "name": "Shed Skin",
    "effect": "The Pokémon may heal its own status problems.\n",
    "desc": "The Pokémon may cure its own status conditions by shedding its skin.",
    "id": "shed-skin",
    "searchTerms": [
      "shed",
      "skin"
    ]
  },
  {
    "name": "Sheer Force",
    "effect": "Sheer Force increases the power of moves that have beneficial secondary effects by 30%, but removes those additional effects.",
    "desc": "Removes any additional effects from the Pokémon's moves, but increases the moves' power.",
    "id": "sheer-force",
    "searchTerms": [
      "sheer",
      "force"
    ]
  },
  {
    "name": "Shell Armor",
    "effect": "Shell Armor prevents the Pokémon from receiving a critical hit.",
    "desc": "A hard shell protects the Pokémon from critical hits.",
    "id": "shell-armor",
    "searchTerms": [
      "shell",
      "armor"
    ]
  },
  {
    "name": "Shield Dust",
    "effect": "Blocks the added effects of attacks taken.\n",
    "desc": "Protective dust shields the Pokémon from the additional effects of moves.",
    "id": "shield-dust",
    "searchTerms": [
      "shield",
      "dust"
    ]
  },
  {
    "name": "Shields Down",
    "effect": "Shields Down causes the Pokémon to changes its appearance and stats depending on its remaining HP.",
    "desc": "When its HP drops to half or less, the Pokémon's shell breaks and it becomes aggressive.",
    "id": "shields-down",
    "searchTerms": [
      "shields",
      "down"
    ]
  },
  {
    "name": "Simple",
    "effect": "The Simple ability doubles the number of stages of all stat changes. Stats can be raised to a maximum of +6 stages each, or lowered to a minimum of -6 stages each.For example, using Swords Dance would increase the Pokémon's attack by 4 stages instead of the usual 2. If Tail Whip was targeted at a Pokémon with Simple, its Defense would drop 2 stages instead of 1.The move Simple Beam can change a Pokémon's ability to Simple.",
    "desc": "Doubles the effects of the Pokémon's stat changes.",
    "id": "simple",
    "searchTerms": [
      "simple"
    ]
  },
  {
    "name": "Skill Link",
    "effect": "Skill Link causes multi-strike moves to always hit their maximum number of times. The moves affected are listed below; note that moves such as Double Kick that always strike the same number of times are not affected.",
    "desc": "Maximizes the number of times multistrike moves hit.",
    "id": "skill-link",
    "searchTerms": [
      "skill",
      "link"
    ]
  },
  {
    "name": "Slow Start",
    "effect": "Temporarily halves Attack and Speed.\n",
    "desc": "For five turns, the Pokémon's Attack and Speed stats are halved.",
    "id": "slow-start",
    "searchTerms": [
      "slow",
      "start"
    ]
  },
  {
    "name": "Slush Rush",
    "effect": "Boosts the Pokémon's Speed stat in a hailstorm.\n",
    "desc": "Boosts the Pokémon's Speed stat in snow.",
    "id": "slush-rush",
    "searchTerms": [
      "slush",
      "rush"
    ]
  },
  {
    "name": "Sniper",
    "effect": "Sniper increases the power of critical hits by 1.5×. This means a critical hit will deal 2.25× normal damage instead of 1.5×.",
    "desc": "If the Pokémon's attack lands a critical hit, the attack is powered up even further.",
    "id": "sniper",
    "searchTerms": [
      "sniper"
    ]
  },
  {
    "name": "Snow Cloak",
    "effect": "Snow Cloak raises ability-bearer's evasion by 20% in a hail storm. It also gives immunity to damage by hail (if they are not already protected by being Ice type).",
    "desc": "Boosts the Pokémon's evasiveness in snow.",
    "id": "snow-cloak",
    "searchTerms": [
      "snow",
      "cloak"
    ]
  },
  {
    "name": "Snow Warning",
    "effect": "Snow Warning creates a hailstorm when the ability-bearer enters battle. The effect lasts 5 turns, unless it is cleared via Air Lock or Cloud Nine or replaced by another weather condition.",
    "desc": "The Pokémon makes it snow when it enters a battle.",
    "id": "snow-warning",
    "searchTerms": [
      "snow",
      "warning"
    ]
  },
  {
    "name": "Solar Power",
    "effect": "During harsh sunlight, Solar Power raises the ability-bearer's Special Attack by 50%, but it also loses 1⁄8 of its maximum HP after each turn.",
    "desc": "In harsh sunlight, the Pokémon's Sp. Atk stat is boosted, but its HP decreases every turn.",
    "id": "solar-power",
    "searchTerms": [
      "solar",
      "power"
    ]
  },
  {
    "name": "Solid Rock",
    "effect": "Solid Rock reduces the damage taken from super-effective attacks by 25%.For example, a Water-type move used against a Rock-type Pokémon with Solid Rock would deal 1.5× the usual damage instead of 2×. A double weakness would be reduced from 4× to 3×.",
    "desc": "Reduces the power of supereffective attacks that hit the Pokémon.",
    "id": "solid-rock",
    "searchTerms": [
      "solid",
      "rock"
    ]
  },
  {
    "name": "Soul-Heart",
    "effect": "Soul-Heart raises the bearer's Special Attack one stage when any Pokémon on the field faints.",
    "desc": "Boosts the Pokémon's Sp. Atk stat every time another Pokémon faints.",
    "id": "soul-heart",
    "searchTerms": [
      "soul",
      "heart"
    ]
  },
  {
    "name": "Soundproof",
    "effect": "Soundproof grants the Pokémon immunity to all sound-based moves, preventing all damage and effects.",
    "desc": "Soundproofing gives the Pokémon full immunity to all sound-based moves.",
    "id": "soundproof",
    "searchTerms": [
      "soundproof"
    ]
  },
  {
    "name": "Speed Boost",
    "effect": "Its Speed stat is gradually boosted.\n",
    "desc": "The Pokémon's Speed stat is boosted every turn.",
    "id": "speed-boost",
    "searchTerms": [
      "speed",
      "boost"
    ]
  },
  {
    "name": "Stakeout",
    "effect": "Stakeout enables the Pokémon to deal twice the normal damage to any Pokémon that switches in or enters the field mid-battle.",
    "desc": "Doubles the damage dealt to a target that has just switched into battle.",
    "id": "stakeout",
    "searchTerms": [
      "stakeout"
    ]
  },
  {
    "name": "Stall",
    "effect": "The Pokémon moves after all other Pokémon do.",
    "desc": "The Pokémon is always the last to use its moves.",
    "id": "stall",
    "searchTerms": [
      "stall"
    ]
  },
  {
    "name": "Stalwart",
    "effect": "Ignores moves and abilities that draw in moves.\n",
    "desc": "Ignores the effects of opposing Pokémon's Abilities and moves that draw in moves.",
    "id": "stalwart",
    "searchTerms": [
      "stalwart"
    ]
  },
  {
    "name": "Stamina",
    "effect": "Stamina raises the bearer's Defense by one stage when it is attacked by any move.",
    "desc": "Boosts the Defense stat when the Pokémon is hit by an attack.",
    "id": "stamina",
    "searchTerms": [
      "stamina"
    ]
  },
  {
    "name": "Static",
    "effect": "If a Pokémon with Static is hit by a move making contact, there is a 30% chance the foe will become paralyzed.",
    "desc": "The Pokémon is charged with static electricity and may paralyze attackers that make direct contact with it.",
    "id": "static",
    "searchTerms": [
      "static"
    ]
  },
  {
    "name": "Steadfast",
    "effect": "Raises Speed each time the Pokémon flinches.\n",
    "desc": "The Pokémon's determination boosts its Speed stat every time it flinches.",
    "id": "steadfast",
    "searchTerms": [
      "steadfast"
    ]
  },
  {
    "name": "Steam Engine",
    "effect": "Steam Engine raises the user's Speed by three stages when it is hit by a Fire- or Water-type attack. The attack still deals damage.",
    "desc": "Boosts the Speed stat drastically when the Pokémon is hit by a Fire- or Water-type move.",
    "id": "steam-engine",
    "searchTerms": [
      "steam",
      "engine"
    ]
  },
  {
    "name": "Steely Spirit",
    "effect": "Powers up ally Pokémon's Steel-type moves.\n",
    "desc": "Powers up the Steel-type moves of the Pokémon and its allies.",
    "id": "steely-spirit",
    "searchTerms": [
      "steely",
      "spirit"
    ]
  },
  {
    "name": "Stench",
    "effect": "A Pokémon with Stench has a 10% chance of causing the opponent to flinch when hit by a damaging move (provided the ability-bearer strikes first as usual).",
    "desc": "By releasing a stench when attacking, the Pokémon may cause the target to flinch.",
    "id": "stench",
    "searchTerms": [
      "stench"
    ]
  },
  {
    "name": "Sticky Hold",
    "effect": "Sticky Hold prevents held items from being taken or switched.",
    "desc": "The Pokémon's held items cling to its sticky body and cannot be removed by other Pokémon.",
    "id": "sticky-hold",
    "searchTerms": [
      "sticky",
      "hold"
    ]
  },
  {
    "name": "Storm Drain",
    "effect": "Storm Drain forces all single-target Water-type moves - used by any other Pokémon on the field - to target this Pokémon, and with 100% accuracy. The ability is most useful in double/triple battles.",
    "desc": "The Pokémon draws in all Water-type moves. Instead of taking damage from them, its Sp. Atk stat is boosted.",
    "id": "storm-drain",
    "searchTerms": [
      "storm",
      "drain"
    ]
  },
  {
    "name": "Strong Jaw",
    "effect": "Strong Jaw increases the power of all biting moves by 50%.",
    "desc": "The Pokémon's strong jaw boosts the power of its biting moves.",
    "id": "strong-jaw",
    "searchTerms": [
      "strong",
      "jaw"
    ]
  },
  {
    "name": "Sturdy",
    "effect": "Sturdy allows the Pokémon to survive with 1 HP if attacked at full HP with an attack that would otherwise knock it out. It also prevents One-Hit-KO moves (Fissure, Horn Drill, Guillotine or Sheer Cold).",
    "desc": "The Pokémon cannot be knocked out by a single hit as long as its HP is full. One-hit KO moves will also fail to knock it out.",
    "id": "sturdy",
    "searchTerms": [
      "sturdy"
    ]
  },
  {
    "name": "Suction Cups",
    "effect": "Suction Cups prevents opponents forcing the ability-bearer to switch out or flee via the moves Roar, Whirlwind, Circle Throw, or Dragon Tail, or the item Red Card.",
    "desc": "The Pokémon uses suction cups to stay in one spot. This protects it from moves and items that would force it to switch out.",
    "id": "suction-cups",
    "searchTerms": [
      "suction",
      "cups"
    ]
  },
  {
    "name": "Super Luck",
    "effect": "Super Luck raises the ability-bearer's critical-hit ratio by one stage (for most moves this increases from a 1⁄16 chance to 1⁄8).",
    "desc": "The Pokémon is so lucky that the critical-hit ratios of its moves are boosted.",
    "id": "super-luck",
    "searchTerms": [
      "super",
      "luck"
    ]
  },
  {
    "name": "Supersweet Syrup",
    "effect": "A sickly sweet scent spreads across the field the first time the Pokémon enters a battle, lowering the evasiveness of opposing Pokémon.",
    "desc": "A sickly sweet scent spreads across the field the first time the Pokémon enters a battle, lowering the evasiveness of opposing Pokémon.",
    "id": "supersweet-syrup",
    "searchTerms": [
      "supersweet",
      "syrup"
    ]
  },
  {
    "name": "Supreme Overlord",
    "effect": "Attack and Special Attack are boosted for each party Pokémon that has been defeated.",
    "desc": "When the Pokémon enters a battle, its Attack and Sp. Atk stats are slightly boosted for each of the allies in its party that have already been defeated.",
    "id": "supreme-overlord",
    "searchTerms": [
      "supreme",
      "overlord"
    ]
  },
  {
    "name": "Surge Surfer",
    "effect": "Surge Surfer doubles the bearer's Speed when Electric Terrain is active.",
    "desc": "Doubles the Pokémon's Speed stat on Electric Terrain.",
    "id": "surge-surfer",
    "searchTerms": [
      "surge",
      "surfer"
    ]
  },
  {
    "name": "Swarm",
    "effect": "Swarm increases the power of Bug-type moves by 50% (1.5×) when the ability-bearer's HP falls below a third of its maximum (known in-game as in a pinch).",
    "desc": "Powers up Bug-type moves when the Pokémon's HP is low.",
    "id": "swarm",
    "searchTerms": [
      "swarm"
    ]
  },
  {
    "name": "Sweet Veil",
    "effect": "Sweet Veil prevents this Pokémon and its allies from falling asleep, for example from moves like Hypnosis.",
    "desc": "Prevents the Pokémon and its allies from falling asleep.",
    "id": "sweet-veil",
    "searchTerms": [
      "sweet",
      "veil"
    ]
  },
  {
    "name": "Swift Swim",
    "effect": "Swift Swim doubles the ability-bearer's Speed during rain.",
    "desc": "Boosts the Pokémon's Speed stat in rain.",
    "id": "swift-swim",
    "searchTerms": [
      "swift",
      "swim"
    ]
  },
  {
    "name": "Sword of Ruin",
    "effect": "Lowers Defense of all Pokémon except itself.\n",
    "desc": "The power of the Pokémon's ruinous sword lowers the Defense stats of all Pokémon except itself.",
    "id": "sword-of-ruin",
    "searchTerms": [
      "sword",
      "of",
      "ruin"
    ]
  },
  {
    "name": "Symbiosis",
    "effect": "The Pokémon can pass an item to an ally.\n",
    "desc": "The Pokémon passes its held item to an ally that has used up an item.",
    "id": "symbiosis",
    "searchTerms": [
      "symbiosis"
    ]
  },
  {
    "name": "Synchronize",
    "effect": "If the opponent causes a burn, paralysis, or poisoning of a Pokémon with Synchronize, the opponent receives the status condition too. Self-inflicted status conditions (for example through the use of an item) are not passed on.",
    "desc": "If the Pokémon is burned, paralyzed, or poisoned by another Pokémon, that Pokémon will be inflicted with the same status condition.",
    "id": "synchronize",
    "searchTerms": [
      "synchronize"
    ]
  },
  {
    "name": "Tablets of Ruin",
    "effect": "Lowers Attack of all Pokémon except itself.\n",
    "desc": "The power of the Pokémon's ruinous wooden tablets lowers the Attack stats of all Pokémon except itself.",
    "id": "tablets-of-ruin",
    "searchTerms": [
      "tablets",
      "of",
      "ruin"
    ]
  },
  {
    "name": "Tangled Feet",
    "effect": "Raises evasion if the Pokémon is confused.\n",
    "desc": "Boosts the Pokémon's evasiveness if it is confused.",
    "id": "tangled-feet",
    "searchTerms": [
      "tangled",
      "feet"
    ]
  },
  {
    "name": "Tangling Hair",
    "effect": "Contact with the Pokémon lowers the attacker's Speed stat.",
    "desc": "Contact with the Pokémon lowers the attacker's Speed stat.",
    "id": "tangling-hair",
    "searchTerms": [
      "tangling",
      "hair"
    ]
  },
  {
    "name": "Technician",
    "effect": "Technician increases the power of moves - that are usually base power 60 or below - by 50%.",
    "desc": "Powers up weak moves so the Pokémon can deal more damage with them.",
    "id": "technician",
    "searchTerms": [
      "technician"
    ]
  },
  {
    "name": "Telepathy",
    "effect": "Pokémon with the Telepathy ability will not take damage from teammates in double and triple battles.",
    "desc": "The Pokémon anticipates and dodges the attacks of its allies.",
    "id": "telepathy",
    "searchTerms": [
      "telepathy"
    ]
  },
  {
    "name": "Tera Shell",
    "effect": "The Pokémon's shell contains the powers of each type. All damage-dealing moves that hit the Pokémon when its HP is full will not be very effective.",
    "desc": "The Pokémon's shell contains the powers of each type. All damage-dealing moves that hit the Pokémon when its HP is full will not be very effective.",
    "id": "tera-shell",
    "searchTerms": [
      "tera",
      "shell"
    ]
  },
  {
    "name": "Tera Shift",
    "effect": "When the Pokémon enters a battle, it absorbs the energy around itself and transforms into its Terastal Form.",
    "desc": "When the Pokémon enters a battle, it absorbs the energy around itself and transforms into its Terastal Form.",
    "id": "tera-shift",
    "searchTerms": [
      "tera",
      "shift"
    ]
  },
  {
    "name": "Teraform Zero",
    "effect": "When Terapagos changes into its Stellar Form, it uses its hidden powers to eliminate all effects of weather and terrain, reducing them to zero.",
    "desc": "When Terapagos changes into its Stellar Form, it uses its hidden powers to eliminate all effects of weather and terrain, reducing them to zero.",
    "id": "teraform-zero",
    "searchTerms": [
      "teraform",
      "zero"
    ]
  },
  {
    "name": "Teravolt",
    "effect": "Teravolt prevents a target's ability from affecting moves that the Teravolt Pokémon uses. It only affects abilities that change the power, accuracy or other effects of moves.",
    "desc": "The Pokémon's moves are unimpeded by the Ability of the target.",
    "id": "teravolt",
    "searchTerms": [
      "teravolt"
    ]
  },
  {
    "name": "Thermal Exchange",
    "effect": "Raises Attack when hit by a Fire-type move. Cannot be burned.\n",
    "desc": "Boosts the Attack stat when the Pokémon is hit by a Fire-type move. The Pokémon also cannot be burned.",
    "id": "thermal-exchange",
    "searchTerms": [
      "thermal",
      "exchange"
    ]
  },
  {
    "name": "Thick Fat",
    "effect": "Thick Fat reduces the damage taken from Fire-type and Ice-type moves by 50%.",
    "desc": "The Pokémon is protected by a layer of thick fat, which halves the damage taken from Fire- and Ice-type moves.",
    "id": "thick-fat",
    "searchTerms": [
      "thick",
      "fat"
    ]
  },
  {
    "name": "Tinted Lens",
    "effect": "Powers up “not very effective” moves.\n",
    "desc": "The Pokémon can use “not very effective” moves to deal regular damage.",
    "id": "tinted-lens",
    "searchTerms": [
      "tinted",
      "lens"
    ]
  },
  {
    "name": "Torrent",
    "effect": "Torrent increases the power of Water-type moves by 50% (1.5×) when the ability-bearer's HP falls below a third of its maximum (known in-game as in a pinch).",
    "desc": "Powers up Water-type moves when the Pokémon's HP is low.",
    "id": "torrent",
    "searchTerms": [
      "torrent"
    ]
  },
  {
    "name": "Tough Claws",
    "effect": "Tough Claws increases the power of moves that make contact.",
    "desc": "Powers up moves that make direct contact.",
    "id": "tough-claws",
    "searchTerms": [
      "tough",
      "claws"
    ]
  },
  {
    "name": "Toxic Boost",
    "effect": "Powers up physical attacks when poisoned.\n",
    "desc": "Powers up physical moves when the Pokémon is poisoned.",
    "id": "toxic-boost",
    "searchTerms": [
      "toxic",
      "boost"
    ]
  },
  {
    "name": "Toxic Chain",
    "effect": "Toxic Chain may cause bad poisoning when the Pokémon hits an opponent with a move.",
    "desc": "Toxic Chain may cause bad poisoning when the Pokémon hits an opponent with a move.",
    "id": "toxic-chain",
    "searchTerms": [
      "toxic",
      "chain"
    ]
  },
  {
    "name": "Toxic Debris",
    "effect": "Scatters poison spikes at the feet of the opposing team when the Pokémon takes damage from physical moves.\n",
    "desc": "Scatters poison spikes at the feet of the opposing team when the Pokémon takes damage from physical moves.",
    "id": "toxic-debris",
    "searchTerms": [
      "toxic",
      "debris"
    ]
  },
  {
    "name": "Trace",
    "effect": "The Pokémon copies a foe's Ability.\n",
    "desc": "When it enters a battle, the Pokémon copies an opposing Pokémon's Ability.",
    "id": "trace",
    "searchTerms": [
      "trace"
    ]
  },
  {
    "name": "Transistor",
    "effect": "Transistor increases the power of Electric-type moves used by this Pokémon by 50%.",
    "desc": "Powers up Electric-type moves.",
    "id": "transistor",
    "searchTerms": [
      "transistor"
    ]
  },
  {
    "name": "Triage",
    "effect": "Triage increases the priority of HP-restoring moves to +3, when used by the ability-bearer.",
    "desc": "Gives priority to the Pokémon's healing moves.",
    "id": "triage",
    "searchTerms": [
      "triage"
    ]
  },
  {
    "name": "Truant",
    "effect": "Truant causes the ability-bearer to only attack every alternate turn. On the even turns, it will say the Pokémon is loafing around.",
    "desc": "Each time the Pokémon uses a move, it spends the next turn loafing around.",
    "id": "truant",
    "searchTerms": [
      "truant"
    ]
  },
  {
    "name": "Turboblaze",
    "effect": "Turboblaze prevents a target's ability from affecting moves that the Turboblaze Pokémon uses. It only affects abilities that change the power, accuracy or other effects of moves.",
    "desc": "The Pokémon's moves are unimpeded by the Ability of the target.",
    "id": "turboblaze",
    "searchTerms": [
      "turboblaze"
    ]
  },
  {
    "name": "Unaware",
    "effect": "Ignores any stat changes in the Pokémon.\n",
    "desc": "When attacking, the Pokémon ignores the target's stat changes.",
    "id": "unaware",
    "searchTerms": [
      "unaware"
    ]
  },
  {
    "name": "Unburden",
    "effect": "Raises Speed if a held item is used.\n",
    "desc": "Boosts the Speed stat if the Pokémon's held item is used or lost.",
    "id": "unburden",
    "searchTerms": [
      "unburden"
    ]
  },
  {
    "name": "Unnerve",
    "effect": "Makes the foe nervous and unable to eat Berries.\n",
    "desc": "Unnerves opposing Pokémon and makes them unable to eat Berries.",
    "id": "unnerve",
    "searchTerms": [
      "unnerve"
    ]
  },
  {
    "name": "Unseen Fist",
    "effect": "Contact moves can strike through Protect/Detect.\n",
    "desc": "If the Pokémon uses moves that make direct contact, it can attack the target even if the target protects itself.",
    "id": "unseen-fist",
    "searchTerms": [
      "unseen",
      "fist"
    ]
  },
  {
    "name": "Vessel of Ruin",
    "effect": "Lowers Special Attack of all Pokémon except itself.\n",
    "desc": "The power of the Pokémon's ruinous vessel lowers the Sp. Atk stats of all Pokémon except itself.",
    "id": "vessel-of-ruin",
    "searchTerms": [
      "vessel",
      "of",
      "ruin"
    ]
  },
  {
    "name": "Vital Spirit",
    "effect": "Vital Spirit prevents the ability-bearer from falling asleep. This means that it also prevents the use of the move Rest.",
    "desc": "The Pokémon is full of vitality, and that prevents it from falling asleep.",
    "id": "vital-spirit",
    "searchTerms": [
      "vital",
      "spirit"
    ]
  },
  {
    "name": "Volt Absorb",
    "effect": "A Pokémon with Volt Absorb heals 1⁄4 of its maximum HP when hit by an Electric-type attack, including Thunder Wave.",
    "desc": "If hit by an Electric-type move, the Pokémon has its HP restored instead of taking damage.",
    "id": "volt-absorb",
    "searchTerms": [
      "volt",
      "absorb"
    ]
  },
  {
    "name": "Water Absorb",
    "effect": "A Pokémon with Water Absorb heals 1⁄4 of its maximum HP when hit by a Water-type attack.",
    "desc": "If hit by a Water-type move, the Pokémon has its HP restored instead of taking damage.",
    "id": "water-absorb",
    "searchTerms": [
      "water",
      "absorb"
    ]
  },
  {
    "name": "Water Bubble",
    "effect": "Water Bubble reduces damage taken from Fire-type moves by 50%, and doubles the power of Water-type moves used by the ability-bearer. It also prevents the Pokémon from being burned.",
    "desc": "Lowers the power of Fire-type moves that hit the Pokémon and prevents it from being burned.",
    "id": "water-bubble",
    "searchTerms": [
      "water",
      "bubble"
    ]
  },
  {
    "name": "Water Compaction",
    "effect": "Water Compaction raises the bearer's Defense by 2 stages when it is hit by a Water-type move.",
    "desc": "Boosts the Defense stat sharply when the Pokémon is hit by a Water-type move.",
    "id": "water-compaction",
    "searchTerms": [
      "water",
      "compaction"
    ]
  },
  {
    "name": "Water Veil",
    "effect": "Prevents the Pokémon from getting a burn.\n",
    "desc": "The Pokémon's water veil prevents it from being burned.",
    "id": "water-veil",
    "searchTerms": [
      "water",
      "veil"
    ]
  },
  {
    "name": "Weak Armor",
    "effect": "When a Pokémon with Weak Armor is hit by a physical move, its Defense drops one stage, but its Speed increases by one stage.",
    "desc": "The Pokémon's Defense stat is lowered when it takes damage from physical moves, but its Speed stat is sharply boosted.",
    "id": "weak-armor",
    "searchTerms": [
      "weak",
      "armor"
    ]
  },
  {
    "name": "Well-Baked Body",
    "effect": "Immune to Fire-type moves, and Defense is sharply boosted.\n",
    "desc": "The Pokémon takes no damage when hit by Fire-type moves. Instead, its Defense stat is sharply boosted.",
    "id": "well-baked-body",
    "searchTerms": [
      "well",
      "baked",
      "body"
    ]
  },
  {
    "name": "White Smoke",
    "effect": "Prevents other Pokémon from lowering its stats.\n",
    "desc": "The Pokémon is protected by its white smoke, which prevents other Pokémon from lowering its stats.",
    "id": "white-smoke",
    "searchTerms": [
      "white",
      "smoke"
    ]
  },
  {
    "name": "Wind Power",
    "effect": "If a Pokémon with Wind Power is hit by a wind move, the power of the next Electric-type move it uses is doubled.",
    "desc": "The Pokémon becomes charged when it is hit by a wind move, boosting the power of the next Electric-type move the Pokémon uses.",
    "id": "wind-power",
    "searchTerms": [
      "wind",
      "power"
    ]
  },
  {
    "name": "Wind Rider",
    "effect": "Wind Rider gives immunity to wind moves, and causes the Pokémon's Attack to increase by one stage when hit by one.",
    "desc": "Boosts the Pokémon's Attack stat if Tailwind takes effect or if the Pokémon is hit by a wind move. The Pokémon also takes no damage from wind moves.",
    "id": "wind-rider",
    "searchTerms": [
      "wind",
      "rider"
    ]
  },
  {
    "name": "Wonder Skin",
    "effect": "Wonder Skin halves the accuracy of all status moves targeted at the ability-bearer.",
    "desc": "Makes status moves more likely to miss the Pokémon.",
    "id": "wonder-skin",
    "searchTerms": [
      "wonder",
      "skin"
    ]
  },
  {
    "name": "Zero to Hero",
    "effect": "Transforms into its Hero Form when switching out.\n",
    "desc": "The Pokémon transforms into its Hero Form when it switches out.",
    "id": "zero-to-hero",
    "searchTerms": [
      "zero",
      "to",
      "hero"
    ]
  }
]
